---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.Flexible
source: html/fd7c444c-e555-dd3f-9e0b-b9b9a9eeddc0.htm
---
# Autodesk.Revit.DB.GroupTypeId.Flexible Property

Adaptive Component.

## Syntax (C#)
```csharp
public static ForgeTypeId Flexible { get; }
```